apache/nuttx/configs/sam3u-ek/src/up_lcd.c
static int sam3u_getpower(struct lcd_dev_s *dev);
static int sam3u_setpower(struct lcd_dev_s *dev, int power);
static int sam3u_getcontrast(struct lcd_dev_s *dev);
static int sam3u_setcontrast(struct lcd_dev_s *dev, unsigned int contrast);

/**************************************************************************************
 * Private Data
 **************************************************************************************/

/* This is working memory allocated by the LCD driver for each LCD device
 * and for each color plane.  This memory will hold one raster line of data.
 * The size of the allocated run buffer must therefor be at least
 * (bpp * xres / 8).  Actual alignment of the buffer must conform to the
 * bitwidth of the underlying pixel type.
 *
 * If there are multiple planes, they may share the same working buffer
 * because different planes will not be operate on concurrently.  However,
 * if there are multiple LCD devices, they must each have unique run buffers.
 */

static uint16_t g_runbuffer[SAM3UEK_XRES];

/* This structure describes the overall LCD video controller */

static const struct fb_videoinfo_s g_videoinfo =
{
  .fmt     = SAM3UEK_RGBFMT,      /* Color format: RGB16-565: RRRR RGGG GGGB BBBB */
  .xres    = SAM3UEK_XRES,        /* Horizontal resolution in pixel columns */
  .yres    = SAM3UEK_YRES,        /* Vertical resolution in pixel rows */
  .nplanes = 1,                   /* Number of color planes supported */
};

/* This is the standard, NuttX Plane information object */

static const struct lcd_planeinfo_s g_planeinfo = 
{
  .putrun = sam3u_putrun,          /* Put a run into LCD memory */
  .getrun = sam3u_getrun,          /* Get a run from LCD memory */
  .buffer = (uint8_t*)g_runbuffer, /* Run scratch buffer */
  .bpp    = SAM3UEK_BPP,           /* Bits-per-pixel */
};

/* This is the standard, NuttX LCD driver object */

static struct sam3u_dev_s g_lcddev_s = 
{
  .dev =
  {
    /* LCD Configuration */
 
    .getvideoinfo = sam3u_getvideoinfo,
    .getplaneinfo = sam3u_getplaneinfo,

    /* LCD RGB Mapping -- Not supported */
    /* Cursor Controls -- Not supported */

    /* LCD Specific Controls */

    .getpower     = sam3u_getpower,
    .setpower     = sam3u_setpower,
    .getcontrast  = sam3u_getcontrast,
    .setcontrast  = sam3u_setcontrast,
  },
};

/**************************************************************************************
 * Private Functions
 **************************************************************************************/

/**************************************************************************************
 * Name:  sam3u_putreg
 *
 * Description:
 *   Write to a HX834x register
 *
 **************************************************************************************/

static void sam3u_putreg(uint16_t reg,  uint16_t data)
{
  putreg16(reg, LCD_BASE);
  putreg16(data, LCD_BASE + HX843X_LCD_RS);
}

/**************************************************************************************
 * Name:  sam3u_getreg
 *
 * Description:
 *   Read from a HX834x register
 *
 **************************************************************************************/

static uint16_t sam3u_getreg(uint16_t reg)
{
  putreg16(reg, LCD_BASE);
  return getreg16(LCD_BASE + HX843X_LCD_RS);
}

/**************************************************************************************
 * Name:  sam3u_setcursor
 *
 * Description:
 *   Set the LCD cursor position.
 *
 **************************************************************************************/

static void sam3u_setcursor(fb_coord_t x, fb_coord_t y)
{
  uint8_t x1;
  uint8_t x2;
  uint8_t y1;
  uint8_t y2;

  x1 =  (uint8_t) x & 0xff;
  x2 = ((uint16_t)x & 0xff00) >> 8;
  y1 =  (uint8_t) y & 0xff;
  y2 = ((uint16_t)y & 0xff00) >> 8;

  sam3u_putreg(HX8347_R02H, x2);        /* column high */
  sam3u_putreg(HX8347_R03H, x1);        /* column low */
  sam3u_putreg(HX8347_R06H, y2);        /* row high */
  sam3u_putreg(HX8347_R07H, y1);        /* row low */
}

/**************************************************************************************
 * Name:  sam3u_wrsetup
 *
 * Description:
 *   Set up for a GRAM write operation.
 *
 **************************************************************************************/

static inline void sam3u_wrsetup(void)
{
  putreg16(HX8347_R22H, LCD_BASE);
}

/**************************************************************************************
 * Name: sam3u_wrram
 *
 * Description:
 *   Write to the 16-bit GRAM register
 *
 **************************************************************************************/

static inline void sam3u_wrram(uint16_t color)
{
  putreg16(color, LCD_BASE + HX843X_LCD_RS);
}

/**************************************************************************************
 * Name: sam3u_rdram
 *
 * Description:
 *   Read from the 16-bit GRAM register
 *
 **************************************************************************************/

static inline uint16_t sam3u_rdram(void)
{
  return getreg16(LCD_BASE + HX843X_LCD_RS);
}

/**************************************************************************************
 * Name:  sam3u_lcdon
 *
 * Description:
 *   Turn the LCD on
 *
 **************************************************************************************/

static void sam3u_lcdon(void)
{
  /* Display ON Setting */

  sam3u_putreg(HX8347_R90H, 0x7f);      /* SAP=0111 1111 */
  sam3u_putreg(HX8347_R26H, 0x04);      /* GON=0 DTE=0 D=01 */
  up_mdelay(100);
  sam3u_putreg(HX8347_R26H, 0x24);      /* GON=1 DTE=0 D=01 */
  sam3u_putreg(HX8347_R26H, 0x2c);      /* GON=1 DTE=0 D=11 */
  up_mdelay(100);
  sam3u_putreg(HX8347_R26H, 0x3c);      /* GON=1 DTE=1 D=11 */
}

/**************************************************************************************
 * Name:  sam3u_lcdoff
 *
 * Description:
 *   Turn the LCD off
 *
 **************************************************************************************/

static void sam3u_lcdoff(void)
{
  sam3u_putreg(HX8347_R90H, 0x00);      /* SAP=0000 0000 */
  sam3u_putreg(HX8347_R26H, 0x00);      /* GON=0 DTE=0 D=00 */
}

/**************************************************************************************
 * Name:  sam3u_dumpreg
 *
 * Description:
 *   Dump a range of LCD registers.
 *
 **************************************************************************************/

#ifdef CONFIG_DEBUG_GRAPHICS
static void sam3u_dumpreg(uint8_t startreg, uint8_t endreg)
{
  uint16_t value;
  uint8_t  addr;

  for (addr = startreg; addr <= endreg; addr++)
    {
      value = sam3u_getreg(addr);
      printf("LCD %02x = %04x\n", addr, value);
    }
}
#endif

/**************************************************************************************
 * Name:  sam3u_putrun
 *
 * Description:
 *   This method can be used to write a partial raster line to the LCD:
 *
 *   row     - Starting row to write to (range: 0 <= row < yres)
 *   col     - Starting column to write to (range: 0 <= col <= xres-npixels)
 *   buffer  - The buffer containing the run to be written to the LCD
 *   npixels - The number of pixels to write to the LCD
 *             (range: 0 < npixels <= xres-col)
 *
 **************************************************************************************/

static int sam3u_putrun(fb_coord_t row, fb_coord_t col, FAR const uint8_t *buffer,
                        size_t npixels)
{
  uint16_t *run = (uint16_t*)buffer;
  unsigned int i;

  /* Buffer must be provided and aligned to a 16-bit address boundary */

  DEBUGASSERT(buffer && ((uintptr_t)buffer & 1) == 0);

