apache/nuttx/configs/sam3u-ek/src/up_lcd.c
  /* Set up for the write */

  sam3u_setcursor(row, col);
  sam3u_wrsetup();

  /* Write the run to GRAM */

  for (i = 0; i < npixels; i++)
    {
      sam3u_wrram(*run++);
    }
  return OK;
}

/**************************************************************************************
 * Name:  sam3u_getrun
 *
 * Description:
 *   This method can be used to read a partial raster line from the LCD:
 *
 *  row     - Starting row to read from (range: 0 <= row < yres)
 *  col     - Starting column to read read (range: 0 <= col <= xres-npixels)
 *  buffer  - The buffer in which to return the run read from the LCD
 *  npixels - The number of pixels to read from the LCD
 *            (range: 0 < npixels <= xres-col)
 *
 **************************************************************************************/

static int sam3u_getrun(fb_coord_t row, fb_coord_t col, FAR uint8_t *buffer,
                        size_t npixels)
{
  uint16_t *run = (uint16_t*)buffer;
  unsigned int i;

  /* Buffer must be provided and aligned to a 16-bit address boundary */

  DEBUGASSERT(buffer && ((uintptr_t)buffer & 1) == 0);

  /* Set up for the read */

  sam3u_setcursor(row, col);

  /* Read the run from GRAM */

  for (i = 0; i < npixels; i++)
    {
      sam3u_wrram(*run++);
    }
  return OK;
}

/**************************************************************************************
 * Name:  sam3u_getvideoinfo
 *
 * Description:
 *   Get information about the LCD video controller configuration.
 *
 **************************************************************************************/

static int sam3u_getvideoinfo(FAR struct lcd_dev_s *dev,
                              FAR struct fb_videoinfo_s *vinfo)
{
  DEBUGASSERT(dev && vinfo);
  memcpy(vinfo, &g_videoinfo, sizeof(struct fb_videoinfo_s));
  return OK;
}

/**************************************************************************************
 * Name:  sam3u_getplaneinfo
 *
 * Description:
 *   Get information about the configuration of each LCD color plane.
 *
 **************************************************************************************/

static int sam3u_getplaneinfo(FAR struct lcd_dev_s *dev, unsigned int planeno,
                              FAR struct lcd_planeinfo_s *pinfo)
{
  DEBUGASSERT(dev && pinfo);
  memcpy(pinfo, &g_planeinfo, sizeof(struct lcd_planeinfo_s));
  return OK;
}

/**************************************************************************************
 * Name:  sam3u_getpower
 *
 * Description:
 *   Get the LCD panel power status (0: full off - CONFIG_LCD_MAXPOWER: full on. On
 *   backlit LCDs, this setting may correspond to the backlight setting.
 *
 **************************************************************************************/

static int sam3u_getpower(struct lcd_dev_s *dev)
{
  struct sam3u_dev_s *priv = (struct sam3u_dev_s *)dev;
  DEBUGASSERT(dev);
  return priv->power;
}

/**************************************************************************************
 * Name:  sam3u_setpower
 *
 * Description:
 *   Enable/disable LCD panel power (0: full off - CONFIG_LCD_MAXPOWERL: full on). On
 *   backlit LCDs, this setting may correspond to the backlight setting.
 *
 *   LCD backlight is made of 4 white chip LEDs in parallel, driven by an AAT3194 charge
 *   pump, MN4. The AAT3194 is controlled by the SAM3U4E through a single line. Simple
 *   Serial Control (S2Cwire) interface, which permits to enable, disable, and set the
 *   LED drive current (LED brightness control) from a 32-level logarithmic scale. Four
 *   resistors R93/R94/R95/R96 are implemented for optional current limitation.
 *
 **************************************************************************************/

static int sam3u_setpower(struct lcd_dev_s *dev, int power)
{
  struct sam3u_dev_s *priv = (struct sam3u_dev_s *)dev;
  unsigned int i;

  DEBUGASSERT(power <= CONFIG_LCD_MAXPOWER);

  /* Switch off backlight */

  sam3u_gpiowrite(GPIO_LCD_BKL, false);

  /* For for at least 500uS to drain the charge pump */

  up_udelay(500);

  /* Set new backlight level by pumping "level" times */

  for (i = 0; i < power; i++)
    {
      sam3u_gpiowrite(GPIO_LCD_BKL, false);
      sam3u_gpiowrite(GPIO_LCD_BKL, false);
      sam3u_gpiowrite(GPIO_LCD_BKL, false);
      sam3u_gpiowrite(GPIO_LCD_BKL, true);;
      sam3u_gpiowrite(GPIO_LCD_BKL, true);;
      sam3u_gpiowrite(GPIO_LCD_BKL, true);;
    }

  priv->power = power;
  return OK;
}

/**************************************************************************************
 * Name:  sam3u_getcontrast
 *
 * Description:
 *   Get the current contrast setting (0-CONFIG_LCD_MAXCONTRAST).
 *
 **************************************************************************************/

static int sam3u_getcontrast(struct lcd_dev_s *dev)
{
  return -ENOSYS;
}

/**************************************************************************************
 * Name:  sam3u_getcontrast
 *
 * Description:
 *   Set LCD panel contrast (0-CONFIG_LCD_MAXCONTRAST).
 *
 **************************************************************************************/

static int sam3u_setcontrast(struct lcd_dev_s *dev, unsigned int contrast)
{
  return -ENOSYS;
}

/**************************************************************************************
 * Public Functions
 **************************************************************************************/

/**************************************************************************************
 * Name:  up_lcdinitialize
 *
 * Description:
 *   Initialize the LCD video hardware.  The initial state of the LCD is fully
 *   initialized, display memory cleared, and the LCD ready to use, but with the power
 *   setting at 0 (full off).
 *
 **************************************************************************************/

int up_lcdinitialize(void)
{
#ifdef CONFIG_DEBUG_GRAPHICS
  uint16_t hxregval;
#endif
  uint32_t regval;
  unsigned int i;

  gvdbg("Initializing\n");

  /* Enable LCD EXTCS2 pins */

  sam3u_configgpio(GPIO_LCD_NCS2);
  sam3u_configgpio(GPIO_LCD_RS);
  sam3u_configgpio(GPIO_LCD_NWE);
  sam3u_configgpio(GPIO_LCD_NRD);

