apache/nuttx/configs/sam3u-ek/src/up_lcd.c
  sam3u_configgpio(GPIO_LCD_D0);
  sam3u_configgpio(GPIO_LCD_D1);
  sam3u_configgpio(GPIO_LCD_D2);
  sam3u_configgpio(GPIO_LCD_D3);
  sam3u_configgpio(GPIO_LCD_D4);
  sam3u_configgpio(GPIO_LCD_D5);
  sam3u_configgpio(GPIO_LCD_D6);
  sam3u_configgpio(GPIO_LCD_D7);
  sam3u_configgpio(GPIO_LCD_D8);
  sam3u_configgpio(GPIO_LCD_D9);
  sam3u_configgpio(GPIO_LCD_D10);
  sam3u_configgpio(GPIO_LCD_D11);
  sam3u_configgpio(GPIO_LCD_D12);
  sam3u_configgpio(GPIO_LCD_D13);
  sam3u_configgpio(GPIO_LCD_D14);
  sam3u_configgpio(GPIO_LCD_D15);

  /* Configure LCD Backlight Pin */

  sam3u_configgpio(GPIO_LCD_D15);

  /* Enable SMC peripheral clock */

  putreg32((1 << SAM3U_PID_SMC), SAM3U_PMC_PCER);

  /* Configure SMC CS2 */

  regval = (4 << SMCCS_SETUP_NWESETUP_SHIFT) | (2 << SMCCS_SETUP_NCSWRSETUP_SHIFT) |
             (4 << SMCCS_SETUP_NRDSETUP_SHIFT) | (2 << SMCCS_SETUP_NCSRDSETUP_SHIFT);
  putreg32(regval, SAM3U_SMCCS_SETUP(2));

  regval = (5 << SMCCS_PULSE_NWEPULSE_SHIFT) | (18 << SMCCS_PULSE_NCSWRPULSE_SHIFT) |
             (5 << SMCCS_PULSE_RDPULSE_SHIFT)  | (18 << SMCCS_PULSE_NCSRDPULSE_SHIFT);
  putreg32(regval, SAM3U_SMCCS_PULSE(2));

  regval = (22 << SMCCS_CYCLE_NWECYCLE_SHIFT) | (22 << SMCCS_CYCLE_NRDCYCLE_SHIFT);
  putreg32(regval, SAM3U_SMCCS_CYCLE(2));

  regval  = getreg32(SAM3U_SMCCS_MODE(2));
  regval &= ~(SMCCS_MODE_DBW_MASK | SMCCS_MODE_PMEN);
  regval |= (SMCCS_MODE_READMODE)  | (SMCCS_MODE_WRITEMODE) | (SMCCS_MODE_DBW_16BITS);
  putreg32(regval, SAM3U_SMCCS_MODE(2));

  /* Check HX8347 Chip ID */

#ifdef CONFIG_DEBUG_GRAPHICS
  hxregval = sam3u_getreg(HX8347_R67H);
  gvdbg("HX8347 chip ID: %04x\n", hxregval);
  if (hxregval != HX8347_CHIPID)
    {
      gdbg("Bad HX8347 chip ID: %04x\n", hxregval);
      return -ENODEV;
    }
#endif

  /* Initialize LCD controller (HX8347) -- Magic code from Atmel LCD example */

  /* Start internal OSC */

  sam3u_putreg(HX8347_R19H, 0x49);      /* OSCADJ=10 0000 OSD_EN=1 60Hz */
  sam3u_putreg(HX8347_R93H, 0x0C);      /* RADJ=1100 */

  /* Power on flow */

  sam3u_putreg(HX8347_R44H, 0x4D);      /* VCM=100 1101 */
  sam3u_putreg(HX8347_R45H, 0x11);      /* VDV=1 0001 */
  sam3u_putreg(HX8347_R20H, 0x40);      /* BT=0100 */
  sam3u_putreg(HX8347_R1DH, 0x07);      /* VC1=111 */
  sam3u_putreg(HX8347_R1EH, 0x00);      /* VC3=000 */
  sam3u_putreg(HX8347_R1FH, 0x04);      /* VRH=0100 */
  sam3u_putreg(HX8347_R1CH, 0x04);      /* AP=100 */
  sam3u_putreg(HX8347_R1BH, 0x10);      /* GASENB=0 PON=1 DK=0 XDK=0 DDVDH_TRI=0 STB=0 */
  up_mdelay(50);
  sam3u_putreg(HX8347_R43H, 0x80);      /* Set VCOMG=1 */
  up_mdelay(50);

  /* Gamma for CMO 2.8 */

  sam3u_putreg(HX8347_R46H, 0x95);
  sam3u_putreg(HX8347_R47H, 0x51);
  sam3u_putreg(HX8347_R48H, 0x00);
  sam3u_putreg(HX8347_R49H, 0x36);
  sam3u_putreg(HX8347_R4AH, 0x11);
  sam3u_putreg(HX8347_R4BH, 0x66);
  sam3u_putreg(HX8347_R4CH, 0x14);
  sam3u_putreg(HX8347_R4DH, 0x77);
  sam3u_putreg(HX8347_R4EH, 0x13);
  sam3u_putreg(HX8347_R4FH, 0x4c);
  sam3u_putreg(HX8347_R50H, 0x46);
  sam3u_putreg(HX8347_R51H, 0x46);

  /* 240x320 window setting */

  sam3u_putreg(HX8347_R02H, 0x00);      /* Column address start2 */
  sam3u_putreg(HX8347_R03H, 0x00);      /* Column address start1 */
  sam3u_putreg(HX8347_R04H, 0x00);      /* Column address end2 */
  sam3u_putreg(HX8347_R05H, 0xef);      /* Column address end1 */
  sam3u_putreg(HX8347_R06H, 0x00);      /* Row address start2 */
  sam3u_putreg(HX8347_R07H, 0x00);      /* Row address start1 */
  sam3u_putreg(HX8347_R08H, 0x01);      /* Row address end2 */
  sam3u_putreg(HX8347_R09H, 0x3f);      /* Row address end1 */

  /* Display Setting */
  
  sam3u_putreg(HX8347_R01H, 0x06);      /* IDMON=0 INVON=1 NORON=1 PTLON=0 */
  sam3u_putreg(HX8347_R16H, 0xc8);      /* MY=1 MX=1 MV=0 BGR=1 */
  sam3u_putreg(HX8347_R23H, 0x95);      /* N_DC=1001 0101 */
  sam3u_putreg(HX8347_R24H, 0x95);      /* P_DC=1001 0101 */
  sam3u_putreg(HX8347_R25H, 0xff);      /* I_DC=1111 1111 */
  sam3u_putreg(HX8347_R27H, 0x06);      /* N_BP=0000 0110 */
  sam3u_putreg(HX8347_R28H, 0x06);      /* N_FP=0000 0110 */
  sam3u_putreg(HX8347_R29H, 0x06);      /* P_BP=0000 0110 */
  sam3u_putreg(HX8347_R2AH, 0x06);      /* P_FP=0000 0110 */
  sam3u_putreg(HX8347_R2CH, 0x06);      /* I_BP=0000 0110 */
  sam3u_putreg(HX8347_R2DH, 0x06);      /* I_FP=0000 0110 */
  sam3u_putreg(HX8347_R3AH, 0x01);      /* N_RTN=0000 N_NW=001 */
  sam3u_putreg(HX8347_R3BH, 0x01);      /* P_RTN=0000 P_NW=001 */
  sam3u_putreg(HX8347_R3CH, 0xf0);      /* I_RTN=1111 I_NW=000 */
  sam3u_putreg(HX8347_R3DH, 0x00);      /* DIV=00 */
  sam3u_putreg(HX8347_R3EH, 0x38);      /* SON=38h */
  sam3u_putreg(HX8347_R40H, 0x0f);      /* GDON=0Fh */
  sam3u_putreg(HX8347_R41H, 0xf0);      /* GDOF=F0h */

  /* Set LCD backlight to FULL off */

  sam3u_setpower(&g_lcddev_s.dev, LCD_FULL_OFF);

  /* Fill the display memory with the color BLACK */

  sam3u_setcursor(0, 0);
  sam3u_wrsetup();
  for (i = 0; i < (SAM3UEK_XRES * SAM3UEK_YRES); i++)
    {
        sam3u_wrram(RGB16_BLACK);
    }

  /* Turn the LCD on (but with the backlight off) */

  sam3u_lcdon();
  return OK;
}

/**************************************************************************************
 * Name:  up_lcdgetdev
 *
 * Description:
 *   Return a a reference to the LCD object for the specified LCD.  This allows
 *   support for multiple LCD devices.
 *
 **************************************************************************************/

FAR struct lcd_dev_s *up_lcdgetdev(int lcddev)
{
  gvdbg("lcddev: %d\n", lcddev);
  return lcddev == 0 ? &g_lcddev_s.dev : NULL;
}

/**************************************************************************************
 * Name:  up_lcduninitialize
 *
 * Description:
 *   Unitialize the framebuffer support.
 *
 **************************************************************************************/

void up_lcduninitialize(void)
{
  /* Turn the LCD off */

  sam3u_lcdoff();

  /* Set LCD backlight to FULL off */

  sam3u_setpower(&g_lcddev_s.dev, LCD_FULL_OFF);

  /* Disable SMC peripheral clock */

  putreg32((1 << SAM3U_PID_SMC), SAM3U_PMC_PCDR);
}


